package Enums;

import Tools.ITool;

public enum Kits implements ITool {
    Traveller("Набор путешественника","Набор путешественника включает в себя рюкзак, простыню, факелы, коробку для трубочек, бурдюк и немного веревки, а также столовый набор для приготовления и приёма пищи, который обычно включает в себя квадратную жестяную банку, чашку и столовые приборы. Набор также включает в себя пайки на несколько дней."),
    DungeonExplorer("Набор исследователя подземелий", """
            Набор исследователя подземелий включает в себя:
            рюкзак, ломик, молоток, 10 шлямбуров, 10 факелов, трутницу, рационы на 10 дней и бурдюк.
            В набор также входит 50-футовая пеньковая верёвка, закреплённая сбоку."""),
    Diplomat("Набор дипломата","сундук," +
            "2 контейнера для карт и свитков," +
            "комплект отличной одежды," +
            "бутылочку чернил," +
            "писчее перо," +
            "лампу," +
            "2 фляги масла," +
            "5 листов бумаги," +
            "флакон духов," +
            "воск," +
            "мыло."),
    Artist("Набор артиста","рюкзак," +
            "спальник," +
            "2 костюма," +
            "5 свечек," +
            "рационы на 5 дней," +
            "бурдюк" +
            "набор для грима."),
    Scientist("Набор ученого","рюкзак," +
            "научную книгу," +
            "бутылочку чернил," +
            "писчее перо," +
            "10 листов пергамента," +
            "небольшую сумочку с песком," +
            "небольшой нож."),
    Priest("Набор священника","рюкзак," +
            "одеяло," +
            "10 свечек," +
            "трутницу," +
            "коробку для пожертвований," +
            "2 упаковки благовоний," +
            "кадило," +
            "облачение," +
            "рационы на 2 дня," +
            "бурдюк."),
    Burglar("Набор взломщика","рюкзак," +
            "сумку с 1 000 металлических шариков," +
            "10 футов лески," +
            "колокольчик," +
            "5 свечек," +
            "ломик," +
            "молоток," +
            "10 шлямбуров," +
            "закрытый фонарь," +
            "2 фляги масла," +
            "рационы на 5 дней," +
            "трутницу" +
            "бурдюк.")

    ;

    Kits(String name , String descr){
this.nm=name;
this.descr=descr;
    }
    public String nm;
    public String descr;
    @Override
    public String getName() {
        return nm;
    }
    @Override
    public String getDescription() {
        return descr;
    }
}
